Revit 2027 API
TextBox Events
The TextBox type exposes the following members.
Events
Name | Description
EnterPressed | Subscribe to this event to be notified when the Enter button is pressed in the text box.
Top
See Also
Reference
TextBox Class
Autodesk.Revit.UI Namespace